In [1]:
import pandas as pd

# Creat Dataframe

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'Department': ['HR', 'Engineering', 'Marketing', 'Finance', 'Sales'],
    'Salary': [50000, 60000, 55000, 70000, 65000]
}

df = pd.DataFrame(data)

In [3]:
df

      Name  Age   Department  Salary
0    Alice   25           HR   50000
1      Bob   30  Engineering   60000
2  Charlie   35    Marketing   55000
3    David   40      Finance   70000
4      Eva   45        Sales   65000

# Create a new column using a lambda function

In [4]:
df['Bonus'] = df['Salary'].apply(lambda x: x * 0.1)

In [5]:
df

      Name  Age   Department  Salary   Bonus
0    Alice   25           HR   50000  5000.0
1      Bob   30  Engineering   60000  6000.0
2  Charlie   35    Marketing   55000  5500.0
3    David   40      Finance   70000  7000.0
4      Eva   45        Sales   65000  6500.0

# Create a flag column from the text column

In [6]:
df['IsEngineering'] = df['Department'].apply(lambda x: x == 'Engineering')

In [7]:
df

      Name  Age   Department  Salary   Bonus  IsEngineering
0    Alice   25           HR   50000  5000.0          False
1      Bob   30  Engineering   60000  6000.0           True
2  Charlie   35    Marketing   55000  5500.0          False
3    David   40      Finance   70000  7000.0          False
4      Eva   45        Sales   65000  6500.0          False